In [1]:
from io import StringIO

import numpy as np
import pandas as pd

In [2]:
data = {'Birth': ['9-1-1900', '1-3-1904', '2-28-1889'],
       'Name': [ 'Fred', 'Márge', 'Henry'],
       'Color': ['Red', 'Blue', None],
       'Number': [3, 1, 9]} # option-e a á
df = pd.DataFrame(data)

## JSON

In [22]:
df

       Birth Color   Name  Number
0   9-1-1900   Red   Fred       3
1   1-3-1904  Blue  Márge       1
2  2-28-1889   NaN  Henry       9

In [23]:
df.to_json()

'{"Birth":{"0":"9-1-1900","1":"1-3-1904","2":"2-28-1889"},"Color":{"0":"Red","1":"Blue","2":null},"Name":{"0":"Fred","1":"M\\u00e1rge","2":"Henry"},"Number":{"0":3,"1":1,"2":9}}'

In [24]:
import json
data = json.loads(df.to_json())

In [26]:
pd.DataFrame(data)

       Birth Color   Name  Number
0   9-1-1900   Red   Fred       3
1   1-3-1904  Blue  Márge       1
2  2-28-1889  None  Henry       9

In [29]:
json_str = df.to_json()

In [31]:
df = pd.read_json(json_str)

In [32]:
df

       Birth Color   Name  Number
0   9-1-1900   Red   Fred       3
1   1-3-1904  Blue  Márge       1
2  2-28-1889  None  Henry       9

In [33]:
df.dtypes

Birth     object
Color     object
Name      object
Number     int64
dtype: object

In [34]:
json_str

'{"Birth":{"0":"9-1-1900","1":"1-3-1904","2":"2-28-1889"},"Color":{"0":"Red","1":"Blue","2":null},"Name":{"0":"Fred","1":"M\\u00e1rge","2":"Henry"},"Number":{"0":3,"1":1,"2":9}}'

In [36]:
df = pd.read_json(json_str, convert_dates=True)
df.dtypes

Birth     object
Color     object
Name      object
Number     int64
dtype: object

In [37]:
pd.to_datetime(df.Birth)

0   1900-09-01
1   1904-01-03
2   1889-02-28
Name: Birth, dtype: datetime64[ns]

In [38]:
df = pd.read_json(json_str, convert_dates=['Birth'])
df.dtypes

Birth     datetime64[ns]
Color             object
Name              object
Number             int64
dtype: object

In [39]:
df

       Birth Color   Name  Number
0 1900-09-01   Red   Fred       3
1 1904-01-03  Blue  Márge       1
2 1889-02-28  None  Henry       9

In [40]:
df.to_json()

'{"Birth":{"0.0":-2187993600000,"1.0":-2082672000000,"2.0":-2551046400000},"Color":{"0.0":"Red","1.0":"Blue","2.0":null},"Name":{"0.0":"Fred","1.0":"M\\u00e1rge","2.0":"Henry"},"Number":{"0.0":3,"1.0":1,"2.0":9}}'

In [41]:
df2 = pd.read_json(df.to_json(), convert_dates='Birth')
df2.dtypes

Birth      int64
Color     object
Name      object
Number     int64
dtype: object

In [42]:
df.to_json(date_format='iso')

'{"Birth":{"0.0":"1900-09-01T00:00:00.000Z","1.0":"1904-01-03T00:00:00.000Z","2.0":"1889-02-28T00:00:00.000Z"},"Color":{"0.0":"Red","1.0":"Blue","2.0":null},"Name":{"0.0":"Fred","1.0":"M\\u00e1rge","2.0":"Henry"},"Number":{"0.0":3,"1.0":1,"2.0":9}}'

In [43]:
df2 = pd.read_json(df.to_json(date_format='iso'), convert_dates='Birth')
df2.dtypes

Birth     object
Color     object
Name      object
Number     int64
dtype: object

In [44]:
df2

                      Birth Color   Name  Number
0  1900-09-01T00:00:00.000Z   Red   Fred       3
1  1904-01-03T00:00:00.000Z  Blue  Márge       1
2  1889-02-28T00:00:00.000Z  None  Henry       9

In [45]:
pd.to_datetime(df2.Birth)

0   1900-09-01
1   1904-01-03
2   1889-02-28
Name: Birth, dtype: datetime64[ns]

In [46]:
df2['Birth'] = pd.to_datetime(df2.Birth)

In [47]:
df2

       Birth Color   Name  Number
0 1900-09-01   Red   Fred       3
1 1904-01-03  Blue  Márge       1
2 1889-02-28  None  Henry       9